{
  "posts": [
    {
      "id": 1,
      "title": "El Lazarillo de Tormes",
      "content": "Por primera vez un personaje, Lázaro de Tormes, cuenta en primera persona su vida desde su infancia hasta su matrimonio haciendo un retrato satírico de la España y la picaresca de la época."
    },
    {
      "title": "La metamorfosis",
      "content": "Narra la historia de Gregor Samsa, un viajante comercial quien una mañana tras un sueño intranquilo se transforma en un monstruoso insecto, provocando a partir de ese momento un enorme drama en su familia.",
      "id": 2
    },
    {
      "title": "El principito",
      "content": "En esta novela corta, Saint-Exupéry habla sobre la idiotez humana y la sabiduría que los niños dejan ir cuando crecen, a través de la historia de un aviador perdido en el desierto tras haber tenido un desperfecto técnico en su avión. Ahí será donde conozca a un pequeño príncipe venido de otro planeta.",
      "id": 3
    },
    {
      "title": "Orgullo y prejuicio",
      "content": "Jane, Elizabeth, Mary, Kitty y Lidia son cinco hermanas que viven con sus padres a las afueras de Londres y que deben contraer matrimonio para que la herencia paterna continúe en el seno familiar. A esa tarea se encomienda con ahínco su madre, quien se siente esperanzada cuando entran en escena Mr. Bingley y Mr. Darcy.",
      "id": 4
    },
    {
      "title": "Romeo y Julieta",
      "content": "La icónica tragedia de Shakespeare comienza con dos familias de Verona, los Montesco y los Capuleto, enemistadas desde tiempos inmemorables. El odio es tan fuerte que incluso se lleva la vida de víctimas inocentes.",
      "id": 5
    },
    {
      "title": "Los Miserables",
      "content": "La historia narra la vida y peripecias de Jean Valjean a través de varios acontecimientos que reflejan la denuncia de la miseria y la pobreza de la época, así como su reflexión sobre las grandes cuestiones morales como la justicia, el bien, el mal o la solidaridad, entre otras.",
      "id": 6
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Homero Simpson",
      "email": "hsimpson@email.com",
      "password": "123"
    },
    {
      "name": "Lisa Simpson",
      "email": "lsimpson@email.com",
      "password": "123",
      "id": 2
    },
    {
      "name": "Bart Simpson",
      "email": "bsimpson@email.com",
      "password": "123",
      "id": 3
    },
    {
      "name": "Marge",
      "email": "margeb@email.com",
      "password": "2321",
      "id": 5
    },
    {
      "name": "Abraham Simpson",
      "email": "asimpson@email.com",
      "password": "345",
      "id": 6
    }
  ]
}